{
  "main": {
    "name": "I'm Irene",
    "occupation": "I'm an italian SW Developer based in Alicante (España)",
    "image": "profile-pic.png",
    "bio": [
      "I am Open Minded   Proactive   Loyable and Reliable",
      "I am looking for a dynamic environment that meets the values I believe in the most: TeamWorking & Play to WIN with Integrity & Respect",
      "Where and How in years from now ? Something I often think about. It scares me a little cos I’ll still be struggling with project timing and deliveries screaming at keyboards and screens 😂 What I am sure of is that I will continue to put in all the effort to be the best version of myself, to keep being a successful and happy woman. And I will be doing this with people that believe in me and give me the opportunity to grow and do great things together ",
           
      "Available to travel occasionally",
      " ... ",
      "Born July 1979, married, 3 childrens and a dog",
      "My time is for family, dog too, MuayThai and Surf",
      "Life philosophy Buenas Vibras",
      " ... ",
      "2005 - Inventor of European Patent No. 05425500.5-"
    ],
    "contactmessage": "Open for work Hybrid or Remotely",
    "email": "Airin79@gmail.com",
    "phone": "+39 328 199 5086",
    "phonees": "+34 643 189 481",
    "address": {
      "city": "Alicante",
      "state": "España",
      "zip": "03540"
    },
    "website": "http://www.ireneorienti.me",
    "resumedownload": "/assets/resume.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "http://www.linkedin.com/in/irene-orienti",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/airin79",
        "className": "fa fa-github"
      },
      {
        "name": "mail",
        "url": "mailto:airin79@gmail.com",
        "className": "fa fa-envelope"
      }
    ]    
  },
  "resume": {
    "skillmessage": "SW developer since the very beginning with 20+ years of C# C++ .Net in stand alone applications on Microsoft SQL Server databases and currently getting fun with the WEB using JS React Entity Framework and GraphQL",
    "educationtitle" : "Education",
    "education": [
      {
        "school": "Computer Science",
        "degree": "60/60 (full marks)",
        "graduated": "July 1998 I.T.I.S Galilei Jesi IT"
      }      
    ],
    "languagetitle" : "Languages",
    "language": [
      {
        "lang": "🇮🇹 Italian",
        "level": "mother tongue"
      },
      {
        "lang": "🇬🇧 English",
        "level": "advanced written & spoken"
      },
      {
        "lang": "🇪🇸 Español",
        "level": "only matter of time (living in Spain) 😊"
      }      
    ],
    "work": [
      {
        "company": "Whirlpool spa",
        "title": "Senior SW Developer",
        "years": "July 2014 - Present",
        "description": [
        "I am responsible for the Electronic Department internal strategic tool to configure and personalize appliance software",
        "I am defining processes, Requirements, Analysis of data and tools to best suit to each need", 
        "Responsible for standardizing the best practices and the best processes among different cross appliances electronic organizations", 
        "Leading the standardization of processes, taking the Best of Best and defining standards. Working Customer oriented for the common Mission",
        "Plus : Company Ambassador : Responsible for creating a positive and productive work environment as an active member of the Engagement Team, organizing Team Building activities to keep people engaged and committed",
        "My best accomplishment at Whirlpool : I created the Cross Team Synergy value ",
        "We have different electronic departments in the same company, one each type of product line. Since they are autonomous, each of them was working with no visibility or interest in how other parallel departments were doing. They did things differently, and often a problem in a department was happening in others too. They were struggling on the same issues, they were replicating the same job and the company was wasting resources. ",
        "I started to collect information and put people work together, having them able to share their processes and best practices, their daily work, their issues and achievements to other departments.",
        "I have been able to put all the departments working together as they realized the value of working as a Team of Teams. Departments still work autonomously and each of them have their own responsibility, but now they can count on others ! It’s been approximately 4 years since our very first meeting and we still meet once a month to grow together."
      ]
     },
      {
        "company": "Indesit Company spa",
        "title": "Junior SW Developer",
        "years": "March 2000 - July 2014",
        "description": [
        "Started as a software developer and gathering experience also in Project Management, my role is various and reach of activities",
        "Working from Concept through delivery in the Research & Innovation department ",
        "Working cross-functionally in collecting data, analyzing scenarios and patterns, defining requirements and developing algorithms applications in the field of -preventive maintenance- and -early Fault discovery",
        "IoT Designs, coding and testing, documenting, build/install, performing analysis on software Requirements ",
        "Responsible for -Fields Tests- projects",
        "Responsible for HW and SW Suppliers engagement Responsible for European Funded projects ",
        "Responsible for End-of-Line test applications in Factories",

        "My best accomplishment at Indesit : A Field Test of our new smart electronic board in 50 united-states customers.",
        "Technicians do not know which is the broken part of an appliance when they are called by customers, so they have to go back a second time bringing materials. This is a waste of energy. ",
        "We built a prototype called ‘cube’ to connect to each and every model of appliance to collect data from machines and, using a smart algorithm data analyzer, to be able to understand which part of an appliance was broken and even predict faults.",
        "As the final phase of the project, we built the ‘cube’ that was installed in 50 American houses. ",
        "I was responsible for the ‘Field test’ in all the phases, from recruiting customers, assurance and privacy papers, installation phase, the field test itself, customer assistance, collection on analysis of data. ",
        "The Field test project gave my company a huge visibility to the actual multinational american company that was working with us and different other projects were started after this."
        


        ]
      },
      {
        "company": "Reale Mutua Ass.ni spa",
        "title": "Director Assistant 1999 - Jesi (AN)",
        "years": "Sept. 1999 - March 2000",
        "description": [
        "Director Assistant and accountant.",
        "My first work experience, a small family-run office. I learned a lot working in contact with the public, becoming very thorough and meticulous from the very beginning ! Precision and quality of the work and right time. After 20 years I still put in place what I’ve learned there in my today daily work."
      ]
      }
    ],
    "skills": [
      {
        "name": "C++ and C#",
        "level": "85%"
      },
      {
        "name": ".NET framework",
        "level": "75%"
      },
      {
        "name": "JavaScript and React",
        "level": "50%"
      },
      {
        "name": "HTML5 and CSS",
        "level": "50%"
      },
      {
        "name": "Entity Framework and GraphQL",
        "level": "25%"
      },
      {
        "name": "SQL databases",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "Simon says",
        "category": "My very first JS application",
        "image": "simon-says.jpeg",
        "url": "add url"
      }
     
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "2020 - Above and Beyond - keep the ‘spirit of Winning’",
        "user": "My department Manager",
        "img": "images/recognition001.png"
      },
      {
        "text": "Irene demonstrated to Play to Win  since she is  strongly  supporting the Setting File team to improve editor and processes. Irene is impacting indirect improvement on Product Quality through her behavior and positive result on this",
        "user": "2020 - From Washing Machine electronic board department Manager - Play to Win",
        "img": ""
      },
      {
        "text": "You are someone who has inspired extraordinary performance in others at Whirlpool",
        "user": "2019 - my supervisor - director of SW Tools area",
        "img": "images/recognition003.png"
      },
      {
        "text": "People Excellence recognition",
        "user": "2018 - Whirlpool spa",
        "img": "images/recognition004.png"
      }
    ]
  }
}
