{
  "main": {
    "name": "Scott McHenry",
    "occupation": "Software and DevOps Engineer",
    "description": "I'm a Vice President of Software Engineering for JPMorgan Chase & Co., and I'm a graduate of both Case Western Reserve University (2014, B.S. Computer Engineering) and Drexel University (2018, M.S. Software Engineering).",
    "image": "profilepic.jpg",
    "bio": "I am an experienced Computer Systems Engineer and Project Manager with a demonstrated history of achievement in software information systems engineering in the public and private sectors. I currently work as a Vice President of Software Engineering for JPMorgan Chase. I previously worked as a Lead Systems Engineer for US Navy Information Systems. I am skilled in the Systems Engineering Process, multiple programming languages including Java, Python, and various .NET languages including C# and Visual Basic, and Microsoft Office tools such as Excel, Project and Sharepoint. He graduated in 2018 from Drexel University with a M.S. degree in Software Engineering, and Case Western Reserve University in 2014 with a B.S. degree in Computer Engineering.",
    "contactmessage": "Feel free to send me a message, and I will get back to you as soon as I can.",
    "email": "smchenry2014@gmail.com",
    "phone": "+1 (215) 595-4873",
    "address": {
      "street": "2603 Heritage Farm Drive",
      "city": "Wilmington",
      "state": "DE",
      "zip": "19808"
    },
    "website": "http://www.timbakerdev.com",
    "resumedownload": "/mchenry-scott-resume.pdf",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/scottmmchenry/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "http://github.com/scottmc500",
        "className": "fa fa-github"
      },
      {
        "name": "stack-overflow",
        "url": "https://stackoverflow.com/users/17783295/scott-mchenry",
        "className": "fa fa-stack-overflow"
      }
    ]
  },
  "resume": {
    "skillmessage": "I have a broad array of knowledge of different software development techniques and tools, but I specialize in designing efficient, scalable back-end microservice cloud architectures and Platform-as-a-Service (PaaS) application delivery.",
    "education": [
      {
        "school": "Case Western Reserve University",
        "degree": "Bachelor of Science in Computer Engineering",
        "graduated": "May 2014",
        "description": "I graduated with a 3.19 GPA.  Relevant course work included Introduction to Data Structures, Computer Architecture, Logic Design and Computer Organization, Circuits and Instruments, Discrete Mathematics, Introduction to Database Systems, Digital Systems Design, Compiler Design, Introduction to Operating Systems, VLSI/CAD, Algorithms and Data Structures, and Programming Language Concepts."
      },
      {
        "school": "Drexel University",
        "degree": "Master of Science in Software Engineering",
        "graduated": "June 2018",
        "description": "I graduated with a 3.86 GPA.  Relavant course work included Advanced Database Management, Data Mining, Information Systems Management, Requirements Engineering and Management, Information Technology Integration, Software Project Management, Human Computer Interaction, Computer Networks, Software Engineering Processes, Information Systems Analysis and Design, Database Management, Evaluation of Information Systems, and Dependable Software Systems."
      }
    ],
    "work": [
      {
        "company": "JPMorgan Chase & Co.",
        "title": "Vice President of Software Engineering",
        "years": "January 2019 - Present",
        "description": "JPMorgan Chase & Co. (NYSE: JPM) is a leading global financial services firm with assets of $2.6 trillion and operations worldwide. The Firm is a leader in investment banking, financial services for consumers and small businesses, commercial banking, financial transaction processing, and asset management. A component of the Dow Jones Industrial Average, JPMorgan Chase & Co. serves millions of consumers in the United States and many of the world's most prominent corporate, institutional and government clients under its J.P. Morgan and Chase brands. Information about JPMorgan Chase & Co. is available at www.jpmorganchase.com."
      },
      {
        "company": "Program Executive Office of Enterprise Information Systems (PEO EIS)",
        "title": "Computer Engineer",
        "years": "June 2018 - December 2018",
        "description": "While working as a civilian with the US Navy, I worked as a mobile application developer for the FMS Calculator mobile app, and as Assistant Program Manager of Engineering (APME) for the Naval Justice Information System (NJIS). I managed all systems engineering processes and day-to-day development. I provided technical expertise to stakeholders across multiple departments and areas of expertise."
      }
    ],
    "skills": [
      {
        "name": "Agile (Scrum/Kanban)",
        "level": "100%"
      },
      {
        "name": "Software Requirements",
        "level": "80%"
      },
      {
        "name": "Cloud Architecture Design",
        "level": "80%"
      },
      {
        "name": "Amazon Web Services",
        "level": "90%"
      },
      {
        "name": "Risk and Schedule Management",
        "level": "70%"
      },
      {
        "name": "Back-End Object-Oriented Programming (Java, Python, C#)",
        "level": "90%"
      },
      {
        "name": "Front-End UX Programming (JavaScript, ReactJS, HTML5)",
        "level": "50%"
      },
      {
        "name": "Relational Databases (Oracle, MySQL, SQLServer, Sybase)",
        "level": "80%"
      },
      {
        "name": "NoSQL Databases (DynamoDB, MongoDB)",
        "level": "50%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "FMS Calculator",
        "category": "A mobile app to help enlisted US Navy personnel advance their careers.",
        "image": "fms-calculator.jpg",
        "url": "https://www.applocker.navy.mil/#!/apps/C28CB458-ADA9-4758-B13E-5F13F1EC4FFF"
      },
      {
        "title": "Naval Justice Information System",
        "category": "A web-based information system that enables ‘cradle-to-grave’ tracking of military/criminal justice information.",
        "image": "NJIS_tri.jpeg",
        "url": "https://www.hqmc.marines.mil/Portals/138/Docs/PS/PSL/NJIS/NJIS_TrifoldFinal.pdf"
      }
    ]
  },
  "testimonials": {
    "testimonials": [
      {
        "text": "Here you should write some nice things that someone has said about you. No lies though, employers can tell when you are lying.",
        "user": "Joshua Kershaw, JPMorgan Chase & Co."
      },
      {
        "text": "That Scott McHenry must be one of the most brilliant developers I've ever met! It is amazing that nobody has hired him yet. Hey you, you should hire this guy, because I am confident that he will be one of your best developers in no time!",
        "user": "Kevin Burnett, PEO EIS"
      }
    ]
  }
}
