{
  "main": {
    "name":"Guruprasad Hebbar",
    "occupation":"Prospective Electrical Engineer",
    "description":"Self-driven and motivated with experience of almost 3 years in developing user-friendly web applications.Highly enthusiastic and a team player to bring out the best in me.",
    "image":"profilepic.jpg",
    "bio":"I am currently pursuing my Master’s degree in Electrical Engineering with a major in Biomedical Systems Engineering at RWTH Aachen University, Germany. During the course of my academic career, I also managed to accrue nearly 3 years of work experience. I had the privilege of working for Robert Bosch Engineering and Business Solutions Limited (BOSCH) as a Software Developer under the corporate research department. During my time as a Software developer, I had various opportunities to work on topics such as Machine Learning, Microservices, Software Development, UX Design and many more and even collaborated with scientists and customers. I was consistently praised as a creative thinker and results-oriented by my peers. I also love playing table tennis, football, billiards, cooking and going on a nature trek.",
    "contactmessage":"Got an internship offer for me ? Or would like to get to know more about me? Please use the below form or send me an email.(Form doesn't work currently, please contact through mail.)",
    "email": "guruhebbar2@gmail.com",
    "phone": "(+49) 1573 7730255",
    "address":{
      "street":"Schillerstrasse 88",
      "city":"Aachen",
      "state":"NRW",
      "country":"Germany",
      "zip": "52064"
    },
    "website": "http://www.guruhebbar.ml",
    "resumedownload":"http://ec2-18-220-196-123.us-east-2.compute.amazonaws.com/file/resume",
    "social":[
      {
        "name":"facebook",
        "url":"https://www.facebook.com/guruhebbar2",
        "className":"fa fa-facebook"
      },
      {
        "name":"linkedin",
        "url":"https://www.linkedin.com/in/guruhebbar2/",
        "className":"fa fa-linkedin"
      },
      {
        "name":"instagram",
        "url":"http://instagram.com/guruhebbar2",
        "className":"fa fa-instagram"
      },
      {
        "name":"github",
        "url":"https://github.com/Guruprasad-Hebbar",
        "className":"fa fa-github"
      }
    ]
  },
  "resume":{
    "skillmessage":"Skillset I'm particularly interested in.",
    "education":[
      {
        "school":"RWTH Aachen University",
        "degree":"Masters in Electrical Engineering",
        "graduated":"April 2019-Present",
        "description":"Currently pursuing my 2nd semester Master's in Electrical Engineering with major in Biomedical System Engineering. I have immense interest to work on medical imaging topics and currently working on project in detecting Microaneurysms in Retinopathy Images using Deep Learning algorithms."
      },
      {
        "school":"PES Institute of Technology",
        "degree":"Bachelor in Electronics and Communication Engineering",
        "graduated":"April 2016",
        "description":"I had worked on two major projects in the field of Healthcare. One was for Texas Instruments challenge, where the goal was design a smart health watch that could be used during the time of distress or emergency. The second one was Robotic hospital bed with autonomous navigation and on the go health monitoring features."
      }
    ],
    "work":[
      {
        "company":"Robert Bosch Engineering and Business Solutions Limited(RBEI)",
        "title":"Software Developer",
        "years":"August 2016 - March 2019",
        "description":[
          "Part of the Corporate Research team in developing ML based Indoor Positioning and Navigation System.",
          "Working as a Full Stack Developer creating RESTful API endpoints using Spring Boot and Web",
          "Development using Angular JS framework.",
          "Worked on Automation of tests and deployment tools like Gradle, JUnit, Jenkins, SonarQube and Github.",
          "Participated and won First Place in AI Department Hackathon held at BOSCH.",
          "Nominated for Best Performing Junior by the department."]
      }
    ],
    "skills":[
      {
        "name":"MATLAB",
        "level":"50%"
      },
      {
        "name":"Python",
        "level":"55%"
      },
      {
        "name":"Java",
        "level":"50%"
      },
      {
        "name":"Javascript",
        "level":"60%"
      },
      {
        "name":"HTML5",
        "level":"80%"
      },
      {
        "name":"MongoDB",
        "level":"70%"
      }
    ]
  },
  "portfolio":{
    "projects": [
      {
        "title":"Microaneurysms detection",
        "category":"Image Processing",
        "image":"canadian-wanderlust.jpg",
        "url":"https://www.canadianwanderlust.com"
      }
    ]
  },
  "testimonials":{
    "testimonials":[
      {
        "text":"blah blah",
        "user":"Kareem Abdul Jabbar"
      },
      {
        "text":"blah blah",
        "user":"Steve Wozniak... impersonator"
      }
    ]
  }
}
